#include <iostream>
#include <clocale>

using namespace std;

/**
* ИВТ-32 Суртаев Сергей
* Дан массив размера N. Переставить в обратном порядке элементы
* массива, расположенные между его минимальным и максимальным элементами, включая минимальный и максимальный элементы.
* динамически
*/
int main() {
    setlocale(LC_ALL, "ru");

    const size_t MAX_SIZE = 50;
    int* a;
    a = new int[MAX_SIZE];
    size_t n;
    cout << "Укажите размер массива: " << endl;
    cin >> n;
    cout << "____________" << endl;
    if (n == 0 || n > MAX_SIZE) {
        cerr << "Ошибка: количество должно находиться в диапазоне [1; "
            << MAX_SIZE << "]" << endl;
        return 1;
    }
    int min = 0, max = 0;
    for (size_t i = 0; i < n; i++) {
        a[i] = rand() % 10; // запись случайного числа, которое вернет rand()
        if (a[i] <= min) min = a[i];
        if (a[i] > max) max = a[i];
        cout << a[i] << endl;
    }
    cout << "____________" << endl;
    for (size_t i = 0, x, y; i < n; i++) {
        if (a[i] == min) {
            y = a[i];
            a[i] = a[0];
            a[0] = y;
        };
        if (a[i] == max) {
            x = a[i];
            a[i] = a[n - 1];
            a[n - 1] = x;
        };
        cout << a[i] << endl;
    }
    cout << "____________" << endl;
    int b;
    for (size_t i = 1, j = n - 2; i < j; i++, j--) {
        b = a[i];
        a[i] = a[j];
        a[j] = b;
    }
    for (size_t i = 0; i < n; i++) {
        cout << a[i] << endl;
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
